Creating parts from ineligible elements
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId IneligibleElementsForParts { get; }
  Visual Basic
Public Shared ReadOnly Property IneligibleElementsForParts As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ IneligibleElementsForParts {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DPartFailures Class
  Autodesk.Revit.DB Namespace